Catalogs/ПЛ_События.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПЛ_События</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьАктивно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ИсточникиСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регистратор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРегистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУсловийРегистрацииСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ВидыУсловийУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаУсловийРегистрацииСобытия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиУсловийРегистрацииСобытия</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентноеЗадание</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьРегламентнойПроверки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПЛ_ПериодичностьРегламентныхПроверок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаРегламентнойПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиРегламентнойПроверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПодписки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ПЛ_ИсточникиСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПЛ_ИсточникиСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИсточникЗаписьДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникСправочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсточникРегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегламентнаяПроверка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассылка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ПЛ_События/Ext/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Возвращает стандартную схему и настройки компоновки условий для переданного события
//
// Для документов и справочников схема в отборах будет содержать их реквизиты
// Для регистра сведений схема в отборах будет содержать поля регистра
// Для регламентной проверки вернется схема проверки
//
// Параметры
//    Событие - СправочникСсылка.ПЛ_События - событие, для которого необходимо получить схему и настройки
//
// Возвращаемое значение
//    Структура с полями "СКД" - схема компоновки данных и "Настройки" - настройки схемы компоновки данных
//
Функция СтандартнаяСхемаУсловийДляСобытия() Экспорт
	
	СхемаИНастройки = Новый Структура;
	СхемаИНастройки.Вставить("СКД", Неопределено);
	СхемаИНастройки.Вставить("Настройки", Неопределено);
	
	ТипИсточника = ИсточникСобытия;
	ИмяИсточника = Регистратор;
	
	Если Не ПустаяСтрока(ИмяИсточника)
		И (ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникДокумент
		Или ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента
		Или ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник) Тогда
		
		СКД = ПолучитьМакет("ПроверкаУсловий");
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	1 КАК Поле1
		|ИЗ
		|	%ИсточникСобытия%.%ИмяРегистратора% КАК %ИмяРегистратора%
		|ГДЕ
		|	%ИмяРегистратора%.Ссылка = &Источник
		|{ГДЕ
		|	%ИмяРегистратора%.Ссылка.* КАК %ИмяРегистратора%}
		|";
		
		Если ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник Тогда
			ВидИсточника = "Справочник";
		Иначе
			ВидИсточника = "Документ";
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИсточникСобытия%", ВидИсточника);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяРегистратора%", ИмяИсточника);
		
		СКД.НаборыДанных.Объект.Запрос = ТекстЗапроса;
		
		СхемаИНастройки.СКД = СКД;
		СхемаИНастройки.Настройки = СКД.НастройкиПоУмолчанию;
		
	ИначеЕсли Не ПустаяСтрока(ИмяИсточника)
		И (ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений) Тогда
		
		СКД = ПолучитьМакет("ПроверкаУсловий");
		
		ТипыСправочников = Справочники.ТипВсеСсылки();
		ТипыДокументов = Документы.ТипВсеСсылки();
		
		ТекстУсловий = "";
		ТаблицаКолонок = РегистрыСведений[ИмяИсточника].СоздатьНаборЗаписей().ВыгрузитьКолонки();
		Для каждого Колонка из ТаблицаКолонок.Колонки Цикл
			
			ИмяПоля = ИмяИсточника + "." + Колонка.Имя;
			
			ЕстьСсылка = Ложь;
			МассивТипов = Колонка.ТипЗначения.Типы();
			Для каждого ТипКолонки из МассивТипов Цикл
				Если ТипыСправочников.СодержитТип(ТипКолонки)
					ИЛИ ТипыДокументов.СодержитТип(ТипКолонки) Тогда
					ЕстьСсылка = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЕстьСсылка Тогда
				ИмяПоля = ИмяПоля + ".*";
			КонецЕсли;
			
			ИмяПоля = ИмяПоля + " КАК " + Колонка.Имя;
			
			ТекстУсловий = ТекстУсловий + ?(ПустаяСтрока(ТекстУсловий), "", ",") + "
			|	" + ИмяПоля;
			
		КонецЦикла;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	1 КАК Поле1
		|ИЗ
		|	РегистрСведений.%ИмяРегистратора% КАК %ИмяРегистратора%
		|{ГДЕ
		|	" + ТекстУсловий + "}
		|";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяРегистратора%", ИмяИсточника);
		
		СКД.НаборыДанных.Объект.Запрос = ТекстЗапроса;
		
		СхемаИНастройки.СКД = СКД;
		СхемаИНастройки.Настройки = СКД.НастройкиПоУмолчанию;
		
	ИначеЕсли ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.РегламентнаяПроверка Тогда
		
		СхемаИНастройки.СКД = СхемаРегламентнойПроверки.Получить();
		СхемаИНастройки.Настройки = НастройкиРегламентнойПроверки.Получить();
		
	КонецЕсли;
	
	Возврат СхемаИНастройки;
	
КонецФункции

// Возвращает стандартную схему и настройки компоновки шаблонов сообщения для переданного события
//
// Для документов и справочников схема в выбранных полях будет содержать их реквизиты
// Для регистра сведений схема в выбранных полях будет содержать поля регистра
// Для регламентной проверки вернется схема проверки
//
// Параметры
//    Событие - СправочникСсылка.ПЛ_События - событие, для которого необходимо получить схему и настройки
//
// Возвращаемое значение
//    Структура с полями "СКД" - схема компоновки данных и "Настройки" - настройки схемы компоновки данных
//
Функция СтандартнаяСхемаШаблоновДляСобытия() Экспорт
	
	СхемаИНастройки = Новый Структура;
	СхемаИНастройки.Вставить("СКД", Неопределено);
	СхемаИНастройки.Вставить("Настройки", Неопределено);
	
	ТипИсточника = ИсточникСобытия;
	ИмяИсточника = Регистратор;
	
	Если Не ПустаяСтрока(ИмяИсточника)
		И (ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникДокумент
		Или ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента
		Или ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник) Тогда
		
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	*
		|ИЗ
		|	%ИсточникСобытия%.%ИмяРегистратора% КАК %ИмяРегистратора%
		|ГДЕ
		|	%ИмяРегистратора%.Ссылка = &Источник
		|";
		
		Если ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник Тогда
			ВидИсточника = "Справочник";
		Иначе
			ВидИсточника = "Документ";
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИсточникСобытия%", ВидИсточника);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяРегистратора%", ИмяИсточника);
		
		СКД = ПЛ_УведомленияОСобытиях.СхемаКомпоновкиДанныхДляЗапроса(ТекстЗапроса);
		
		ПЛ_УведомленияОСобытиях.ДобавитьВКомпоновкуПолеТекущийПользователь(СКД);
		
		СхемаИНастройки.СКД = СКД;
		СхемаИНастройки.Настройки = СКД.НастройкиПоУмолчанию;
		
	// В запросе для регистра сведений нужны отборы компоновки, чтобы фильтровать выборку по набору записей
	ИначеЕсли НЕ ПустаяСтрока(ИмяИсточника)
		И (ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений) Тогда
		
		ТипыСправочников = Справочники.ТипВсеСсылки();
		ТипыДокументов = Документы.ТипВсеСсылки();
		
		ТекстУсловий = "";
		ТаблицаКолонок = РегистрыСведений[ИмяИсточника].СоздатьНаборЗаписей().ВыгрузитьКолонки();
		Для каждого Колонка из ТаблицаКолонок.Колонки Цикл
			
			ИмяПоля = ИмяИсточника + "." + Колонка.Имя;
			
			ЕстьСсылка = Ложь;
			МассивТипов = Колонка.ТипЗначения.Типы();
			Для каждого ТипКолонки из МассивТипов Цикл
				Если ТипыСправочников.СодержитТип(ТипКолонки)
					ИЛИ ТипыДокументов.СодержитТип(ТипКолонки) Тогда
					ЕстьСсылка = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЕстьСсылка Тогда
				ИмяПоля = ИмяПоля + ".*";
			КонецЕсли;
			
			ИмяПоля = ИмяПоля + " КАК " + Колонка.Имя;
			
			ТекстУсловий = ТекстУсловий + ?(ПустаяСтрока(ТекстУсловий), "", ",") + "
			|	" + ИмяПоля;
			
		КонецЦикла;
		
		ТекстЗапроса = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	*
		|ИЗ
		|	РегистрСведений.%ИмяРегистратора% КАК %ИмяРегистратора%
		|{ГДЕ
		|	" + ТекстУсловий + "}
		|";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяРегистратора%", ИмяИсточника);
		
		СКД = ПЛ_УведомленияОСобытиях.СхемаКомпоновкиДанныхДляЗапроса(ТекстЗапроса);
		
		ПЛ_УведомленияОСобытиях.ДобавитьВКомпоновкуПолеТекущийПользователь(СКД);
		
		СхемаИНастройки.СКД = СКД;
		СхемаИНастройки.Настройки = СКД.НастройкиПоУмолчанию;
		
	ИначеЕсли ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.РегламентнаяПроверка Тогда
		
		СхемаИНастройки.СКД = СхемаРегламентнойПроверки.Получить();
		СхемаИНастройки.Настройки = НастройкиРегламентнойПроверки.Получить();
	КонецЕсли;
	
	Возврат СхемаИНастройки;
	
КонецФункции

// Возвращает стандартную схему и настройки компоновки выборки адресатов сообщения для переданного события
//
// Для документов и справочников схема в выбранных полях будет содержать их реквизиты
// Для регистра сведений схема в выбранных полях будет содержать поля регистра
// Для регламентной проверки вернется схема проверки
//
// Параметры
//    Событие - СправочникСсылка.ПЛ_События - событие, для которого необходимо получить схему и настройки
//
// Возвращаемое значение
//    Структура с полями "СКД" - схема компоновки данных и "Настройки" - настройки схемы компоновки данных
//
Функция СтандартнаяСхемаВыборкиАдресатовДляСобытия() Экспорт
	
	СхемаИНастройки = Новый Структура;
	СхемаИНастройки.Вставить("СКД", Неопределено);
	СхемаИНастройки.Вставить("Настройки", Неопределено);
	
	ТипИсточника = ИсточникСобытия;
	ИмяИсточника = Регистратор;
	
	Если Не ПустаяСтрока(ИмяИсточника)
		И (ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникДокумент
		Или ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникЗаписьДокумента
		Или ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник) Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	*
		|ИЗ
		|	%ИсточникСобытия%.%ИмяРегистратора% КАК %ИмяРегистратора%
		|ГДЕ
		|	%ИмяРегистратора%.Ссылка = &Источник
		|";
		
		Если ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникСправочник Тогда
			ВидИсточника = "Справочник";
		Иначе
			ВидИсточника = "Документ";
		КонецЕсли;
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИсточникСобытия%", ВидИсточника);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяРегистратора%", ИмяИсточника);
		
		СКД = ПЛ_УведомленияОСобытиях.СхемаКомпоновкиДанныхДляЗапроса(ТекстЗапроса);
		
		ПЛ_УведомленияОСобытиях.ДобавитьВКомпоновкуПолеТекущийПользователь(СКД);
		
		СхемаИНастройки.СКД = СКД;
		СхемаИНастройки.Настройки = СКД.НастройкиПоУмолчанию;
		
	// В запросе для регистра сведений нужны отборы компоновки, чтобы фильтровать выборку по набору записей
	ИначеЕсли НЕ ПустаяСтрока(ИмяИсточника)
		И (ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.ИсточникРегистрСведений) Тогда
		
		ТипыСправочников = Справочники.ТипВсеСсылки();
		ТипыДокументов = Документы.ТипВсеСсылки();
		
		ТекстУсловий = "";
		ТаблицаКолонок = РегистрыСведений[ИмяИсточника].СоздатьНаборЗаписей().ВыгрузитьКолонки();
		Для каждого Колонка из ТаблицаКолонок.Колонки Цикл
			
			ИмяПоля = ИмяИсточника + "." + Колонка.Имя;
			
			ЕстьСсылка = Ложь;
			МассивТипов = Колонка.ТипЗначения.Типы();
			Для каждого ТипКолонки из МассивТипов Цикл
				Если ТипыСправочников.СодержитТип(ТипКолонки)
					ИЛИ ТипыДокументов.СодержитТип(ТипКолонки) Тогда
					ЕстьСсылка = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			Если ЕстьСсылка Тогда
				ИмяПоля = ИмяПоля + ".*";
			КонецЕсли;
			
			ИмяПоля = ИмяПоля + " КАК " + Колонка.Имя;
			
			ТекстУсловий = ТекстУсловий + ?(ПустаяСтрока(ТекстУсловий), "", ",") + "
			|	" + ИмяПоля;
			
		КонецЦикла;
		
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	*
		|ИЗ
		|	РегистрСведений.%ИмяРегистратора% КАК %ИмяРегистратора%
		|{ГДЕ
		|	" + ТекстУсловий + "}
		|";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "%ИмяРегистратора%", ИмяИсточника);
		
		СКД = ПЛ_УведомленияОСобытиях.СхемаКомпоновкиДанныхДляЗапроса(ТекстЗапроса);
		
		ПЛ_УведомленияОСобытиях.ДобавитьВКомпоновкуПолеТекущийПользователь(СКД);
		
		СхемаИНастройки.СКД = СКД;
		СхемаИНастройки.Настройки = СКД.НастройкиПоУмолчанию;
		
	ИначеЕсли ТипИсточника = Перечисления.ПЛ_ИсточникиСобытий.РегламентнаяПроверка Тогда
		
		СхемаИНастройки.СКД = СхемаРегламентнойПроверки.Получить();
		СхемаИНастройки.Настройки = НастройкиРегламентнойПроверки.Получить();
		
	КонецЕсли;
	
	Возврат СхемаИНастройки;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.РегламентнаяПроверка
		Или ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.Рассылка Тогда
		Индекс = ПроверяемыеРеквизиты.Найти("ПредставлениеРегистратора");
		Если Индекс <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.РегламентнаяПроверка
		И ДополнительныеСвойства.Свойство("Запуск")
		И ДополнительныеСвойства.Запуск Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗадание);
		Если Задание = Неопределено Тогда
			
			Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Метаданные.РегламентныеЗадания.ПЛ_УведомленияПоРегламентнымПроверкам);
			Задание.Использование = Истина;
			Задание.Наименование = Справочники.ПЛ_События.НаименованиеЗадания(Наименование);
			Задание.Расписание = ДополнительныеСвойства.Расписание;
			Задание.Записать();
			
			РегламентноеЗадание = Задание.УникальныйИдентификатор;
			
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
	Иначе
		
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗадание);
		Если Задание <> Неопределено Тогда
			Задание.Удалить();
		КонецЕсли;
		
		РегламентноеЗадание = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗадание);
	Если Задание <> Неопределено Тогда
		Задание.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	РегламентноеЗадание = Неопределено;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ИсточникСобытия = Перечисления.ПЛ_ИсточникиСобытий.РегламентнаяПроверка Тогда
		
		УстановитьПривилегированныйРежим(Истина);
	
		Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(РегламентноеЗадание);
		Если Задание <> Неопределено Тогда
			
			ЗаданиеИзменено = Ложь;
			Если ДополнительныеСвойства.Свойство("Расписание")
				И ТипЗнч(ДополнительныеСвойства.Расписание) = Тип("РасписаниеРегламентногоЗадания")
				И Строка(ДополнительныеСвойства.Расписание) <> Строка(Задание.Расписание) Тогда
				Задание.Расписание = ДополнительныеСвойства.Расписание;
				ЗаданиеИзменено = Истина;
			КонецЕсли;
			
			НаименованиеЗадания = Справочники.ПЛ_События.НаименованиеЗадания(Наименование);
			Если Задание.Наименование <> НаименованиеЗадания Тогда
				Задание.Наименование = НаименованиеЗадания;
				ЗаданиеИзменено = Истина;
			КонецЕсли;
			
			Если Не Задание.Использование Тогда
				Задание.Использование = Истина;
				ЗаданиеИзменено = Истина;
			КонецЕсли;
			
			Если Задание.Параметры.Количество() <> 1 ИЛИ Задание.Параметры[0] <> Ссылка Тогда
				ПараметрыЗадания = Новый Массив;
				ПараметрыЗадания.Добавить(Ссылка);
				Задание.Параметры = ПараметрыЗадания;
				ЗаданиеИзменено = Истина;
			КонецЕсли;
				
			Если ЗаданиеИзменено Тогда
				Задание.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
